Revit 2027 API
FamilyManager.Types Property
All family types in the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyTypeSet Types { get; }
Public ReadOnly Property Types As FamilyTypeSet
	Get
public:
property FamilyTypeSet^ Types {
	FamilyTypeSet^ get ();
}
member Types : FamilyTypeSet with get
Property Value
FamilyTypeSet
Example
public void GetFamilyTypesInFamily(Document familyDoc)
{
    if (familyDoc.IsFamilyDocument)
    {
        FamilyManager familyManager = familyDoc.FamilyManager;
        // get types in family
        string types = "Family Types: ";
        FamilyTypeSet familyTypes = familyManager.Types;
        FamilyTypeSetIterator familyTypesItor = familyTypes.ForwardIterator();
        familyTypesItor.Reset();
        while (familyTypesItor.MoveNext())
        {
            FamilyType familyType = familyTypesItor.Current as FamilyType;
            types += "\n" + familyType.Name;
        }
        TaskDialog.Show("Revit",types);
    }
}
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace